Tekla.Structures.ModelInternal.GraphicObjectContainer
Graphic object is a container for drawable object in Tekla Structures model view
Graphic object contains a group of graphical elements

Tekla.Structures.ModelInternal.GraphicObjectContainer.schema
Schema of container (mandatory)

Tekla.Structures.ModelInternal.GraphicObjectContainer.Id
Id of container

Tekla.Structures.ModelInternal.GraphicObjectContainer.Schema
Schema of container (mandatory)

Tekla.Structures.ModelInternal.GraphicObjectContainer.DefaultColor
Id of container

Tekla.Structures.ModelInternal.GraphicObjectContainer.Points
Points of container

Tekla.Structures.ModelInternal.GraphicObjectContainer.Lines
Lines of container

Tekla.Structures.ModelInternal.GraphicObjectContainer.PolyLines
Polylines of container

Tekla.Structures.ModelInternal.GraphicObjectContainer.Surfaces
Surfaces of container

Tekla.Structures.ModelInternal.GraphicObjectContainer.Texts
Texts of container

Tekla.Structures.ModelInternal.GraphicObjectContainer.#ctor(System.String,Tekla.Structures.Model.UI.Color)
Initializes a new instance of the Tekla.Structures.ModelInternal.GraphicObjectContainer class.
Default color is solid black.
Currently line type of Tekla.Structures.Model.UI.GraphicPolyLine class is not used.
schema: The mandatory schema used for identification of type of container.
color: The default color for objects in container.